app/views/users/_resource_info.erb

                            </td>
                            <td><%=res.role.name unless res.role.blank?%></td>
---
SELECT `roles`.* FROM `roles` WHERE `roles`.`id` = 2 ORDER BY `roles`.`id` ASC LIMIT 1