app/controllers/users_controller.rb

  def set_user
    @user = User.includes([:department, :role, :addresses, :boss]).find(params[:id])
---
SELECT `roles`.* FROM `roles` WHERE `roles`.`id` = 2 ORDER BY `roles`.`id` ASC LIMIT 1
SELECT `users`.* FROM `users` WHERE `users`.`id` IN (8, 1, 9, 44, 12, 51, 2, 43, 47, 45, 46, 50, 48, 49)

  def resource_track
     first_quarter = Date.new(Date.today.year,1,1) + 3.months
     second_quarter = first_quarter + 3.months
     third_quarter = second_quarter + 3.months
     fourth_quarter = third_quarter + 3.months
     puts first_quarter, second_quarter, third_quarter, fourth_quarter
     months = {1=>first_quarter, 2=>first_quarter, 3=>first_quarter, 4=>second_quarter, 5=>second_quarter, 6=>second_quarter, 7=>third_quarter, 8=>third_quarter, 9=>third_quarter, 10=>fourth_quarter, 11=>fourth_quarter, 12=>fourth_quarter}
     @res_availability = params[:res_range].blank? ? Time.now.to_date : "month".eql?(params[:res_range]) ? Time.now.end_of_month.to_date : months[Time.now.month].to_date
  	 # @billable_res = @company.users.where("delete_flag is not true and user_type='employee' and resource_type='billable'")
     @user_current_project = {}
	 @projects = @company.projects.includes(:client_contacts).where("status in ('not_started','started') and delete_flag is not true and end_date > '#{@res_availability}'")
---
SELECT `projects`.* FROM `projects` WHERE `projects`.`company_id` = 1 AND (status in ('not_started','started') and delete_flag is not true and end_date > '2014-02-07')

       p "bench", @bench_res.map(&:id)
       unless @bench_res.blank?
         @bench_res.each do |user|
              user.technologies.blank? ?  @technology["Others"] << user  : user.technologies.each{|tech| @technology[tech.name] << user}
---
SELECT `technologies`.* FROM `technologies` INNER JOIN `technologies_users` ON `technologies`.`id` = `technologies_users`.`technology_id` WHERE `technologies_users`.`user_id` = 43

    def resource_search
      @res_tb_type = params[:res_tb_type]
      query = "delete_flag is not true and user_type='employee'"
      query += " and technologies.id in (#{params[:tech].join(",")})" unless params[:tech].blank?
      query += "and experience  #{params[:exp_cond]} #{params[:exp].to_f}" unless params[:exp].blank?
      query += " and gender = '#{params[:gender]}' " unless params[:gender].blank?
      query += " and role_id in (#{params[:role].join(",")}) " unless params[:role].blank?
      query += " and resource_type in (" + "'" + "#{params[:res_type].join("','")}" + "'" + ") " unless params[:res_type].blank?
      @res = @company.users.includes(:technologies).where(query).references(:technologies)
      @technology = {"Others"=>[]}
      @employees = []
      @user_current_project = {}
      @technologies.each{|tech| @technology[tech.name] = [] }
      @projects = @company.projects.includes(:client_contacts).where("status in ('not_started','started')")
---
SELECT `technologies`.* FROM `technologies` WHERE `technologies`.`company_id` = 1
SELECT `projects`.* FROM `projects` WHERE `projects`.`company_id` = 1 AND (status in ('not_started','started'))